disruptivepatternmaterial/M5StickCPlus2_Remote_For_DJI_Osmo/sdkconfig.defaults.m5sticks3
# M5 StickS3 — ESP32-S3-PICO-1-N8R8 (8MB Flash + 8MB OPI PSRAM per M5 / esptool chip read).
#
CONFIG_IDF_TARGET="esp32s3"

# Bluetooth (match Plus2 BLE feature set)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Flash 8MB (QIO)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# OPI PSRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
# Default 2048 overflowed during BLE scanning storms (every adv packet runs through
# host callbacks / soft-timers). 4096 leaves headroom for esp_log formatting in BT paths.
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096
# BTC (callback) task default 3072 is also tight when scan-result handlers do any work.
CONFIG_BT_BTC_TASK_STACK_SIZE=4096

CONFIG_SPI_MASTER_ISR_IN_IRAM=y

# BLE-only camera remote: Wi-Fi competes with BLE on the same 2.4 GHz radio on ESP32-S3.
# Keeping Wi-Fi enabled has caused unstable BLE scanning/connecting in the field.
CONFIG_ESP_WIFI_ENABLED=n

# Light sleep / DFS can interfere with BLE link setup; this device has no battery sleep requirement in firmware.
CONFIG_PM_ENABLE=n
